$(function(){
	var province=[{
		name:"北京",city:[
		{name:"北京市",county:["顺义区","大兴区","昌平区","通州区","门头沟区","房山区","东城区","西城区","崇文区","宣武区","朝阳区","丰台区","石景山区","海淀区","怀柔区","平谷区","延庆县","密云县"]}
		]
	},{
		name:"天津",city:[
		{name:"天津市",county:["和平区","河东区","河西区","南开区","河北区","红桥区","塘沽区","汉沽区","大港区","东丽区","西青区","津南区","北辰区","武清区","宝坻区","蓟县","宁河县","静海县","其他区县"]}
		]
	},{
		name:"河北",city:[
		{name:"石家庄市",county:['长安区','桥东区','桥西区','新华区','裕华区','井陉矿区','辛集市','藁城市','晋州市','新乐市','鹿泉市','井陉县','正定县','栾城县','行唐县','灵寿县','高邑县','高新技术产业开发区','元氏县','赞皇县','赵县','深泽县','无极县','平山县','其他区县']},
		{name:"张家口市",county:['桥西区','桥东区','宣化区','下花园区','宣化县','张北县','康保县','沽源县','尚义县','蔚县','阳原县','怀安县','万全县','怀来县','涿鹿县','赤城县','崇礼县','高新区','其他区县']},
		{name:"承德市",county:['双桥区','双滦区','鹰手营子矿区','承德县','兴隆县','平泉县','滦平县','隆化县','丰宁满族自治县','宽城满族自治县','围场满族蒙古族自治县','其他区县']},
		{name:"秦皇岛市",county:['海港区','山海关区','北戴河区','昌黎县','抚宁县','卢龙县','青龙满族自治县','经济技术开发区','其他区县']},
		{name:"唐山市",county:['路北区','路南区','古冶区','开平区','丰润区','丰南区','遵化市','迁安市','滦县','滦南县','乐亭县','迁西县','玉田县','唐海县','高新区','其他区县']},
		{name:"邢台市",county:['桥东区','桥西区','南宫市','沙河市','邢台县','临城县','内丘县','柏乡县','隆尧县','任县','南和县','宁晋县','巨鹿县','新河县','广宗县','平乡县','威县','清河县','临西县','其他区县']},
		{name:"邯郸市",county:['丛台区','邯山区','复兴区','峰峰矿区','武安市','邯郸县','临漳县','成安县','大名县','涉县','磁县','肥乡县','永年县','邱县','鸡泽县','广平县','馆陶县','魏县','曲周县','高开区','其他区县']},
		{name:"保定市",county:['涿州市','新市区','北市区','南市区','定州市','安国市','高碑店市','满城县','清苑县','易县','徐水县','涞源县','定兴县','顺平县','唐县','望都县','涞水县','高阳县','安新县','雄县','容城县','曲阳县','阜平县','博野县','蠡县','其他区县']},
		{name:"沧州市",county:['运河区','新华区','泊头市','任丘市','黄骅市','河间市','沧县','青县','东光县','海兴县','盐山县','肃宁县','南皮县','吴桥县','献县','孟村回族自治县','其他区县']},
		{name:"廊坊市",county:['安次区','广阳区','霸州市','三河市','固安县','永清县','香河县','大城县','文安县','大厂回族自治县','其他区县']},
		{name:"衡水市",county:['桃城区','冀州市','深州市','枣强县','武邑县','武强县','饶阳县','安平县','故城县','景县','阜城县','其他区县']},
		{name:"其他城市",county:['无']},
		]
	},{
		name:"山西",city:[
		{name:"太原市",county:['清徐县','古交市','阳曲县','杏花岭区','小店区','迎泽区','尖草坪区','万柏林区','晋源区','娄烦县','其他区县']},
		{name:"大同市",county:['城区','矿区','南郊区','新荣区','阳高县','天镇县','广灵县','灵丘县','浑源县','左云县','大同县','其他区县']},
		{name:"朔州市",county:['朔城区','平鲁区','山阴县','应县','右玉县','怀仁县','其他区县']},
		{name:"阳泉市",county:['城区','矿区','郊区','平定县','盂县','其他区县']},
		{name:"晋城市",county:['城区','高平市','泽州县','沁水县','阳城县','陵川县','其他区县']},
		{name:"长治市",county:['城区','郊区','潞城市','长治县','襄垣县','屯留县','平顺县','黎城县','壶关县','长子县','武乡县','沁县','沁源县','其他区县']},
		{name:"晋中市",county:['榆次区','祁县','太谷县','平遥县','介休市','榆社县','左权县','和顺县','昔阳县','寿阳县','灵石县','其他区县']},
		{name:"运城市",county:['盐湖区','永济市','河津市','芮城县','临猗县','万荣县','新绛县','稷山县','闻喜县','夏县','绛县','平陆县','垣曲县','其他区县']},
		{name:"临汾市",county:['侯马市','尧都区','霍州市','曲沃县','翼城县','襄汾县','洪洞县','古县','安泽县','浮山县','吉县','乡宁县','蒲县','大宁县','永和县','隰县','汾西县','其他区县']},
		{name:"忻州市",county:['原平市','忻府区','定襄县','五台县','代县','繁峙县','宁武县','静乐县','神池县','五寨县','岢岚县','河曲县','保德县','偏关县','其他区县']},
		{name:"吕梁市",county:['孝义市','汾阳市','交城县','文水县','离石区','中阳县','兴县','临县','方山县','柳林县','岚县','交口县','石楼县','其他区县']},
		{name:"其他城市",county:['无']},
		]
	},{
		name:"内蒙古",city:[
		{name:"呼和浩特市",county:['回民区','新城区','玉泉区','赛罕区','托克托县','武川县','和林格尔县','清水河县','土默特左旗','经济开发区','其他区县']},
		{name:"乌海市",county:['海勃湾区','海南区','乌达区','其他区县']},
		{name:"包头市",county:['昆都仑区','东河区','青山区','石拐区','白云矿区','九原区','固阳县','土默特右旗','达尔罕茂明安联合旗','其他区县']},
		{name:"赤峰市",county:['红山区','元宝山区','松山区','宁城县','林西县','阿鲁科尔沁旗','巴林左旗','巴林右旗','克什克腾旗','翁牛特旗','喀喇沁旗','敖汉旗','新城区','其他区县']},
		{name:"通辽市",county:['科尔沁区','霍林郭勒市','开鲁县','库伦旗','奈曼旗','扎鲁特旗','科尔沁左翼中旗','科尔沁左翼后旗','其他区县']},
		{name:"鄂尔多斯市",county:['东胜区','达拉特旗','准格尔旗','鄂托克前旗','鄂托克旗','杭锦旗','乌审旗','伊金霍洛旗','其他区县']},
		{name:"呼伦贝尔市",county:['满洲里市','海拉尔区','扎兰屯市','牙克石市','根河市','额尔古纳市','阿荣旗','新巴尔虎右旗','新巴尔虎左旗','陈巴尔虎旗','鄂伦春自治旗','鄂温克族自治旗','莫力达瓦达斡尔族自治旗','其他区县']},
		{name:"巴彦淖尔市",county:['临河区','五原县','磴口县','乌拉特前旗','乌拉特中旗','乌拉特后旗','杭锦后旗','其他区县']},
		{name:"乌兰察布市",county:['集宁区','丰镇市','卓资县','化德县','商都县','兴和县','凉城县','察哈尔右翼前旗','察哈尔右翼中旗','察哈尔右翼后旗','四子王旗','其他区县']},
		{name:"兴安盟",county:['乌兰浩特市','阿尔山市','突泉县','科尔沁右翼前旗','科尔沁右翼中旗','扎赉特旗','其他区县']},
		{name:"锡林郭勒盟",county:['锡林浩特市','二连浩特市','多伦县','阿巴嘎旗','苏尼特左旗','苏尼特右旗','东乌珠穆沁旗','西乌珠穆沁旗','太仆寺旗','镶黄旗','正镶白旗','正蓝旗','其他区县']},
		{name:"阿拉善盟",county:['阿拉善左旗','阿拉善右旗','额济纳旗','其他区县']}
		]
	}];
/*{name:"",county:[]},*/











	for(var i=0;i<province.length;i++){
		$("#province").append('<option value="'+province[i].name+'">'+province[i].name+'</option>');
	}
	
	$("#province").change(function(){
		for(var i=0;i<province.length;i++){
			if($("#province").val()==province[i].name){
				$("#city")[0].options.length=1;
				$("#county")[0].options.length=1;
				for(var j=0;j<province[i].city.length;j++){
					$("#city").append('<option value="'+province[i].city[j].name+'">'+province[i].city[j].name+'</option>');
				}
			}
		}
	});

	$("#city").change(function() {
		for(var i=0;i<province.length;i++){
			for(var j=0;j<province[i].city.length;j++){
				if($("#city").val()==province[i].city[j].name){
					$("#county")[0].options.length=1;
					for(var k=0;k<province[i].city[j].county.length;k++){
						$("#county").append('<option value="'+province[i].city[j].county[k]+'">'+province[i].city[j].county[k]+'</option>');
					}
				}
			}
		}
	});
});










